{"world":{"6-01":{"id":"6-01","name":"Lair - Lift Base","description":"You are now standing at the base of the lift, above you is a long shaft which the lift descended from.  This seems to be the base of the elevator, it seems impossible to force the lift to return to the top level.  You can not easily  see the area around you because it is too dark.  There is a small chaos star  which seems to be burning in the middle of several pillars.\nTo the north there is a dark passageway.\n","exits":{"north":"6-02"}},"6-02":{"id":"6-02","name":"Lair - Necrotalia's Chamber","description":"You are now standing in the chambers of the daemon Necrotalia.\nUnfortunately here is where the game ends for now =) Normally right here we'd have an epic boss fight but sadly we have no battle system built in for you  to have such a fight - you'll just have to wait.\nSo for now I've given you a portal back to the encampment, enjoy!\n","exits":{"north":"1-01"}},"5-16":{"id":"5-16","name":"Sanctuary - Northwestern Altar","description":"You are now standing at a dead end.  There is a small shrine built into the wall, displayed on the shrine is a jade coloured gem.\n","exits":{"south east":"5-07"}},"5-08":{"id":"5-08","name":"Sanctuary - North East","description":"You are now standing in the northeastern area of a great hall. the hall is strangely bare except for the large raised platform in the middle of the hall, which has the shape of a chaos star.\n","exits":{"north":"5-12","north east":"5-14","east":"5-11","south":"5-06","south west":"5-09","west":"5-07"}},"5-18":{"id":"5-18","name":"Northern Passageway - Altar","description":"You are now standing at a dead end.  There is a small shrine built into the nearby wall, on the shrine lies a black gem.\n","exits":{"south":"5-12"}},"5-04":{"id":"5-04","name":"Southern Passageway - Fork","description":"You have entered a three way intersection, to the east and west are  bending passageways.  To the south is the long passageway.\n","exits":{"east":"5-06","south":"5-03","west":"5-05"}},"5-03":{"id":"5-03","name":"Southern Passageway","description":"You are now standing in another section of the tunnel.  So far the tunnel hasn't shown any bends or turns.\n","exits":{"north":"5-04","south":"5-02"}},"5-02":{"id":"5-02","name":"Southern Passageway - Orange Gem Altar","description":"You have entered a bright red-orange passage with many torches burning high.  On the floor is a small raised platform with an orange gem embedded in it.\n","exits":{"north":"5-03","south":"5-01"}},"5-12":{"id":"5-12","name":"Northern Passageway - Fork","description":"You are now standing in an intersection.  This intersection seems to resemble all the other intersections.  There is a bending hallway to the east and west. There is a short hallway to the north.\n","exits":{"north":"5-18","east":"5-08","west":"5-07"}},"5-15":{"id":"5-15","name":"Sanctuary - Southwestern Altar","description":"You are now standing at a dead end.  Built into the nearest wall is a small shrine.  On the shrine a white gem is displayed.\n","exits":{"north east":"5-05"}},"5-17":{"id":"5-17","name":"Eastern Passageway - Altar","description":"You are now standing at a dead end.  The wall here has a shrine built in it.  On the shrine a grey gem is displayed.\n","exits":{"west":"5-11"}},"5-14":{"id":"5-14","name":"Sanctuary - Northeastern altar","description":"You are now standing at a dead end in the short hallway.  Inserted into the wall is a shrine with a red gem displayed.\n","exits":{"south west":"5-08"}},"5-10":{"id":"5-10","name":"Western Passageway - Fork","description":"You are now standing in an intersection.  This intersection resembles all the others.  There is a bending hallway to the north and south. There is a short hallway to the west.\n","exits":{"north":"5-07","south":"5-05","west":"5-19"}},"5-11":{"id":"5-11","name":"Eastern Passageway - Fork","description":"You are now standing in an intersection.  This intersection seems to be identical to all the others.  There is a bending hallway to the south and north.  There is a short hallway to the east\n","exits":{"north":"5-08","east":"5-17","south":"5-06"}},"5-05":{"id":"5-05","name":"Sanctuary - South West","description":"You are now standing in the southwestern area of a great hall. the hall is strangely bare except for the large raised platform in the middle of the hall, which has the shape of a chaos star.\n","exits":{"north":"5-07","north east":"5-09","east":"5-06","south":"5-04","south west":"5-15","west":"5-10"}},"5-13":{"id":"5-13","name":"Sanctuary - Southeastern Altar","description":"You are now standing at a dead end.  In the dead end's wall is a small shrine.  Displayed on the shrine is a blue gem.\n","exits":{"north west":"5-06"}},"5-06":{"id":"5-06","name":"Sanctuary - South East","description":"You are now standing in the southeastern area of a great hall. the hall is strangely bare except for the large raised platform in the middle of the hall, which has the shape of a chaos star.\n","exits":{"north":"5-08","east":"5-11","south east":"5-13","south":"5-04","west":"5-05","north west":"5-09"}},"5-01":{"id":"5-01","name":"Entrance","description":"You have descended down the stairwell into a poorly lit square room. One wall has several markings on it that interest you.  When you look closer you notice a sphere shaped socket with burn marks around it.\n","exits":{"north":"5-02","up":"4-16"}},"5-07":{"id":"5-07","name":"Sanctuary - North West","description":"You are now standing in the northwestern area of a great hall. the hall is strangely bare except for the large raised platform in the middle of the hall, which has the shape of a chaos star.\n","exits":{"north":"5-12","east":"5-08","south east":"5-09","south":"5-05","west":"5-10","north west":"5-16"}},"5-09":{"id":"5-09","name":"Sanctuary - Chancel","description":"You are now standing on the raised platform in the middle of the hall. Below you is a strange symbol which has markings and text on it.\n","exits":{"north west":"5-07","north east":"5-08","south east":"5-06","south west":"5-05","down":"6-01"}},"5-19":{"id":"5-19","name":"Western Passageway - Altar","description":"You are now standing at a dead end.  In the closest wall is a small shrine displayed on the shrine is a blood gem.\n","exits":{"east":"5-10"}},"2-01":{"id":"2-01","name":"Bridge above the Fiery Pit","description":"You're standing on a smooth stone bridge crossing the chasm above they fiery pit.  Far above you all you can see is the dark starless night, you can attempt to ascend the pit walls to reach your encampment once again.  Examining the bridge you find one end abruptly ends a the side of a cliff wall with what was once a stairway along the cliff edge descending to this bridge.  The other end of this bridge ends at an elaborate doorjam with stone statues flanking both sides.  Beyond the jam is a small room with two adjoining hallways.\n","exits":{"south":"2-02","up":"1-03"}},"2-16":{"id":"2-16","name":"Western Jail","description":"The western jail cell is completely bare and devoid of any objects.\n","exits":{"east":"2-11"}},"2-04":{"id":"2-04","name":"Intersection","description":"You look around.  This is an intersection of four paths.  To the north is a small bending tunnel.  To the east and west is a dark corridor. The south hallway leads into a large room.\n","exits":{"north":"2-02","east":"2-07","west":"2-03","south":"2-08"}},"2-15":{"id":"2-15","name":"Southern Jail","description":"You enter this cell which, except for a few skeletons, seems to be bare.\n","exits":{"north":"2-11"}},"2-05":{"id":"2-05","name":"Storage Room","description":"You have entered the storage room, it seems as it should except for the corpse lying propped against a wall.  On the shelves are several broken bottles possibly containing potions at one time.\n","exits":{"east":"2-03"}},"2-03":{"id":"2-03","name":"Intersection","description":"You are now standing in an intersection.  To the north is a tunnel To the east is a long corridor that falls into darkness. To the west is a small storage closet. The south hallway opens into a large room.\n","exits":{"north":"2-02","east":"2-04","south":"2-06","west":"2-05"}},"2-07":{"id":"2-07","name":"Junction","description":"This is a small junction of two hallways.  To the west is a long dark tunnel.  To the east is the entrance to a large hall.\n","exits":{"west":"2-04","south":"2-09"}},"2-14":{"id":"2-14","name":"Eastern Jail","description":"You enter a jail cell inhabited by one skeleton.\n","exits":{"west":"2-11"}},"2-09":{"id":"2-09","name":"Dining Hall","description":"You are standing at the head of this hallway dominated by corpses. You hear the scuttering of undead minions nearby and decide to move away from this hallway quickly.  To the north is a small corridor. To the west is the rest of the hall.  To the east lies a stage with a  large throne on top.\n","exits":{"north":"2-07","east":"2-12","west":"2-08"}},"2-08":{"id":"2-08","name":"Dining Hall","description":"This room is dominated by corpses and blood.  You begin to feel an urge to leave this evil hall and quickly search for exits. To the north lies a small corridor.  To the east and west lie the rest of the hall. To the south is a small dark passageway.\n","exits":{"north":"2-04","east":"2-09","south":"2-11","west":"2-06"}},"2-12":{"id":"2-12","name":"Stage","description":"You are now standing on the stage, corpses here appear to be crucified. There is a large throne sitting in the middle of the stage.\n","exits":{"east":"2-13","west":"2-09"}},"2-02":{"id":"2-02","name":"Entrance","description":"You enter a small room with two adjoining hallways.\n","exits":{"north":"2-01","east":"2-04","west":"2-03"}},"2-10":{"id":"2-10","name":"Spiral Staircase","description":"You have entered the room which contains a spiral staircase.  Other than the staircase the room seems blank.\n","exits":{"east":"2-06","down":"3-01"}},"2-06":{"id":"2-06","name":"Dining Hall","description":"You are now standing...in a hall of horror.  Littered all around are corpses of dwarfs and humans.  Some lay on tables with cut marks on their bodies.  Some are fresh and still leak blood. You turn your head away from this horror to any possible exits you can find. To the north is a small corridor.  To the west lies a small room which appears to be a spiral staircase, and to the east remains the rest of this great hall of horror.\n","exits":{"north":"2-03","east":"2-08","west":"2-10"}},"2-11":{"id":"2-11","name":"Prison Entrance","description":"You enter the dark hallway, the surrounding area appears to be jail cells, skeletons seem to inhabit these once empty rooms. There are a total of three jail cells to the east, west and south.\n","exits":{"north":"2-08","east":"2-14","south":"2-15","west":"2-16"}},"2-13":{"id":"2-13","name":"Secret Room","description":"You enter the secret room behind the throne. The room seems bare except for the table in the middle and the ladder in the southeast corner.\n","exits":{"west":"2-12","down":"4-03"}},"4-10":{"id":"4-10","name":"Western area","description":"You are now standing in the western area of the encampment.\n","exits":{"north":"4-11","south":"4-09"}},"4-05":{"id":"4-05","name":"Northeastern area","description":"You are now standing in the northeastern area it is possible to access the watch tower from here\n","exits":{"south":"4-06","west":"4-04","up":"4-12"}},"4-15":{"id":"4-15","name":"Northwestern Tower","description":"You are now standing on the northwestern watch tower\n","exits":{"down":"4-11"}},"4-07":{"id":"4-07","name":"Southeastern area","description":"You are now standing in the southeastern area. It is possible to climb the watchtower from here.   \n","exits":{"north":"4-06","west":"4-08","up":"4-13"}},"4-04":{"id":"4-04","name":"Northern area","description":"You have entered the northern area of this encampment.\n","exits":{"north":"4-02","east":"4-05","south":"4-16","west":"4-11"}},"4-12":{"id":"4-12","name":"Northeastern Tower","description":"You are now standing on the northeastern watch tower\n","exits":{"down":"4-05"}},"4-09":{"id":"4-09","name":"Southwestern area","description":"You are now standing in the southwestern area of the encampment. It is possible to enter the watch tower from here.\n","exits":{"north":"4-10","east":"4-08","up":"4-14"}},"4-03":{"id":"4-03","name":"Secret Room","description":"You have entered a small chamber with a hidden door and a ladder. The ladder goes back up to the first level.\n","exits":{"up":"2-13","east":"4-02"}},"4-06":{"id":"4-06","name":"Eastern area","description":"You are now standing in the eastern area\n","exits":{"north":"4-05","south":"4-07"}},"4-11":{"id":"4-11","name":"Northwestern area","description":"You are now standing in the north western area of the encampment. it is possible to climb the watch tower from here.\n","exits":{"east":"4-04","south":"4-10","up":"4-15"}},"4-02":{"id":"4-02","name":"Hallway","description":"You have entered a small hallway with walls on all sides, to the southern end of this hallway is a large open area, it appears that this is another area of the city.  Faintly in the distance however you see what looks like watch towers.\n","exits":{"north":"4-01","west":"4-03","south":"4-04"}},"4-13":{"id":"4-13","name":"Southeastern Tower","description":"You are now standing on the southeastern watch tower\n","exits":{"down":"4-07"}},"4-16":{"id":"4-16","name":"Encampment","description":"You are now standing inside the encampment, except for a few tents and the campfire you see nothing special,  there is one thing however, a stairway leading down into the darkness.\n","exits":{"north":"4-04","down":"5-01"}},"4-08":{"id":"4-08","name":"Southern area","description":"You are now standing in the southern area\n","exits":{"east":"4-07","west":"4-09"}},"4-01":{"id":"4-01","name":"Lift","description":"The lift has arrived at its lower level, the smell of fresh air floods into it making you feel refreshed.  To the south is short hallway opening out to a large open area.\n","exits":{"south":"4-02","up":"3-06"}},"4-14":{"id":"4-14","name":"Southwestern Tower","description":"You are now standing on the southwestern watch tower\n","exits":{"down":"4-09"}},"3-11":{"id":"3-11","name":"Oubliette","description":"You have entered the dark room. Before you is a deep pit which leads off into the darkness.  There is a walkway forming a U in the room.  In the middle of the room is a small platform with a skeleton in the middle.\n","exits":{"west":"3-09"}},"3-05":{"id":"3-05","name":"Intersection","description":"You have entered a 3-Way intersection.  To the north is the large hall. To the east is a long tunel.  The southern exit leads to an open area which appears to be a chasm.\n","exits":{"north":"3-02","east":"3-09","south":"3-10"}},"3-04":{"id":"3-04","name":"Intersection","description":"You have entered an intersection. There are exits to all directions. To the north is a long tunnel.  To the west is a large hall.  To the south is another long tunnel.\n","exits":{"north":"3-03","east":"3-07","south":"3-09","west":"3-02"}},"3-12":{"id":"3-12","name":"Chasm","description":"You have arrived at the eastern edge of the chasm.  The area around you is very open, but plain.\n","exits":{"north":"3-09","west":"3-10"}},"3-03":{"id":"3-03","name":"Intersection","description":"You have entered a small intersection with four exits. The unlocked northern  door leads to a sort of lift.  The eastern door leads into a well lit room  with several corpses inside. To the south is another long passageway.   To the west is a passage that bends south.\n","exits":{"north":"3-06","east":"3-07","south":"3-04","west":"3-02"}},"3-15":{"id":"3-15","name":"Skull Chamber","description":"You have entered a small room with many skulls embedded into the wall. As you gaze around the room you realize that two skulls are missing, there are coloured sockets in their place.  One is gold, the other is jade.\n","exits":{"north":"3-13"}},"3-01":{"id":"3-01","name":"Base of the Spiral Staircase","description":"You are now at the bottom of the spiral staircase.  A small hallway to the east opens up into a large spacious room with a burning fire in the middle of this room.\n","exits":{"east":"3-02","up":"2-10"}},"3-07":{"id":"3-07","name":"Corpse filled room","description":"You have entered a large dimly lit room filled with corpses. You stare in disgust as you see that their blood seems to be draining into a small pool.  As much as you hate to look at the pool you can make out the edge of a underwater tunnel.\n","exits":{"north west":"3-03","south west":"3-04","down":"3-08"}},"3-14":{"id":"3-14","name":"Raised Platform","description":"You have entered a room with a raised platform in the middle.  On the raised platform is a stand.  On the stand is an empty socket in the shape of a chaos star.\n","exits":{"south":"3-13"}},"3-10":{"id":"3-10","name":"Chasm","description":"You have entered a large open space with a chasm in the middle. You can't see the bottom of the chasm.  Other than that the area is plain.\n","exits":{"north":"3-05","east":"3-12"}},"3-06":{"id":"3-06","name":"Lift","description":"You are now standing in some kind of lift.  The room is bare except for a large chaos star burned into the middle.  In the middle of the lift is a socket in the shape of a chaos star.\n","exits":{"south":"3-03","down":"4-01"}},"3-08":{"id":"3-08","name":"Blood Pool Room","description":"You are now standing a room on the far side of the underwater blood pool tunnel.  The room seems relatively plain, made of smooth stone bricks  with the blood resevoir cut into the middle of the floor in a circular tear shape.  To the east you can make out a shrine built into the wall.\n","exits":{"east":"3-13","down":"3-07"}},"3-02":{"id":"3-02","name":"Torture Room","description":"You have entered a large room with stone walls.  Several pillars dominate the area.  There is a large burning fire in the center of the room, which  appears to have the form of a chaos star. In the center of the flames you can  see a table with a dead corpse.\n","exits":{"north":"3-03","east":"3-04","south":"3-05","west":"3-01"}},"3-13":{"id":"3-13","name":"Shrine","description":"You have entered a small intersection with a chaos shrine placed in one of the walls.  There are exits to the north, south and west. To the north is a tunnel emerging into a small room. The south passage also leads to a small room.  To the west is the pool of blood.\n","exits":{"north":"3-14","south":"3-15","west":"3-08"}},"3-09":{"id":"3-09","name":"Intersection","description":"This area is yet another intersection.  This particular intersection  splits four ways.  To the north is a long tunnel.  To the east is a small room which you can't identify from this distance.  To the south is a large open room which seems to be a chasm. The western exit leads down a long hallway.\n","exits":{"north":"3-04","east":"3-11","south":"3-12","west":"3-05"}},"1-03":{"id":"1-03","name":"Fiery Pit","description":"You are standing at the precipice of the fiery pit, looking down into it you see a smooth stone bridge crossing the gap of the fiery pit about 10 metres down.  The pit continues down for several metres further and ends in a solid surface which burns with unnatural fires.  If you are careful you should  be able to descend down the pit wall to the bridge.\n","exits":{"south":"1-01","down":"2-01"}},"1-02":{"id":"1-02","name":"Abandoned Shoppe","description":"You step into the abandoned shop, there are several cracks in the floor the shelves are ransacked.  Several broken jars that once contained  potions now lie on the floor.  Other than that the shop seems empty.\n","exits":{"south":"1-01"}},"1-01":{"id":"1-01","name":"Encampment","description":"You sit in front of the campfire.  The dark city is quiet for now, you begin to look at your surroundings.  An old shop is off to the northeast.  There is a set of pillars surrounding a chaos star carved into the ground nearby.  The fiery pit lies to the northwest.\n","exits":{"north east":"1-02","north west":"1-03"}}}}
